{"shiny cowbird": ["Shiny black plumage with a metallic green or purple sheen", "Red eyes and yellow bill", "White wing bars on the shoulders", "Long, pointed tail feathers with white tips", "Short but powerful legs"], "yellow headed blackbird": ["Large, yellow head with a black throat", "Black body and wings", "White wing bars on the outer edges of their wings", "Dark bill and eyes", "Long legs for wading in shallow water"], "belted kingfisher": ["Distinctive black, white and rust colored plumage", "Large head and long bill", "Short crest on the back of the head", "Rust colored band across its breast", "Pale blue wings with black barring near tips"], "olive sided flycatcher": ["Olivegray upperparts", "Pale yellowish underparts", "White throat and breast sides", "Dark eye line and crown stripe", "Two white wing bars", "Black tail with white outer feathers"], "pigeon guillemot": ["Black and white body with a black head, back and wings", "Long pointed beak", "Red feet", "White face with dark stripes on either side of its bill", "Large ovalshaped tail feathers that are slightly rounded at the tip"], "yellow billed cuckoo": ["Smaller size compared to other cuckoos", "Dark gray top and white underside", "Whitespotted black wings with yellow shoulder patches", "Black tail with white edges and a yellow tip at the end", "Yellow bill with a slight curve near the tip"], "california gull": ["White head with black eyering and bill", "Light gray mantle, wings and tail", "Darker gray patch on the wings at their base", "Pearly white belly", "Orange legs and feet", "Yellowish beak with a red spot near the tip"], "lazuli bunting": ["Blue wings, back and tail with black wingtips", "White or yellowish belly", "Chestnut colored patches on the sides of the neck and head", "Dark brown eyes", "Gray bill", "White stripes above and below eye"], "least flycatcher": ["Large white eye ring with a black center", "Grayisholive upperparts and pale underparts", "White wing bars and tail tip on a grayishbrown tail", "Puffy crown of feathers on its head", "Long, thin bill with a slightly curved shape"], "pied billed grebe": ["Blackandwhite striped head and neck", "Brownish barred back, wings and tail", "Thick yellow bill with a black band near the tip", "White chin patch", "Red eyes", "Short legs situated far back on its body"], "gray catbird": ["Gray body with a black cap, bib and tail feathers", "White patch at the base of the tail", "A white eyering that is more prominent in breeding males", "Long rusty brown undertail coverts with white highlights", "Black bill and legs"], "black billed cuckoo": ["Overall greybrown coloring with barred black and white wings", "Long tail with a central white stripe bordered by black on either side", "Dark bill, legs and feet", "White eye ring", "Loud cuckoo call"], "northern fulmar": ["Long, slender wings", "White underside with grey back and black primaries", "Pale yellow bill", "Red eyering", "Black tail band and tips of the wings", "Dark underwing linings"], "brewer blackbird": ["Glossy black plumage with a distinctive purple or green iridescent sheen on the wings, tail, and head.", "White eye stripe", "Red eyes", "Dark gray bill", "Yellow legs and feet"], "american crow": ["Large, black body with a long, fanshaped tail", "Glossy feathers and white eyes", "A thick, yellow bill", "Strong flight capabilities for covering long distances", "Flies in large groups or “murders”", "Makes loud cawing sounds"], "scott oriole": ["Orange head, wings, and tail with black stripes on back", "Black eye patch and throat bib", "White wing bars across the wings", "Dark brownishgray upperparts and underparts", "Gray legs"], "mockingbird": ["Large head with a long, rounded tail and short wings", "Greyishbrown upperparts and whitish underparts", "White patches on the wings and white outermost tail feathers", "Black eyes surrounded by a prominent patch of grey/white feathers", "Long legs with pale yellow feet."], "red faced cormorant": ["Redbrownish face and throat", "White collar around the neck", "Greenishyellow bill with a black tip", "Dark brown eyes", "Black legs and feet", "Gray body plumage with white barring on wings"], "rusty blackbird": ["Slender body shape and long tail", "Black feathers with rustybrown edges, especially on the wings and tail", "White patch near the shoulder of each wing", "Dark black bill", "White eye ring around dark eyes", "Long yellow legs"], "ivory gull": ["All white plumage with light grey in the wings and back", "Small, dark eyes with a yellow eyering", "Long, slender wings with pointed tips", "Short tail that is deeply forked at the tip", "Black bill and legs"], "red winged blackbird": ["Large black body with bright red shoulder patches and yellow wing bars", "Long pointed bill that is slightly upturned at the end", "White patch on their outer tail feathers", "Graybrown wings, legs, and feet", "Brown eyes"], "tropical kingbird": ["Large head and bill", "Gray upperparts with darker gray wings, tail, and mask", "Bright yellow underparts", "White throat and forehead", "Thin white edges on wings", "Long tail with white outer feathers"], "ruby throated hummingbird": ["Dark green back with a grayish underside", "Long, thin and slightly forked tail", "Ruby red throat patch on the male (absent in female)", "White tips to its outermost tail feathers when viewed from behind", "Small white patches at the base of its tail feathers", "Whitetipped wings"], "white breasted nuthatch": ["White underparts with a black stripe on the breast", "Pale gray upperparts", "Black crown and nape of neck", "Long, pointed bill with a slight downward curve", "Bluegray face and white eyebrow line", "Short tail which is usually held cocked up over its back"], "red breasted merganser": ["Long, slim body with a sharppointed tail", "Dark green head and neck feathers", "Grayish brown back and sides", "White chest with reddishbrown streaks on the throat and breast", "Red bill and legs"], "american goldfinch": ["Bright yellow body with black cap and wings", "White patches on its wings and tail", "Thin, pointed bill", "Dark gray legs and feet", "Male has a bright red patch at the shoulder of its wing"], "hooded merganser": ["Creamy white crest on the head", "Reddishbrown face, upper neck and breast", "Glossy greenishblack back and wings", "White sides with vertical barring", "Rounded tail with a black band at the tip", "Orange legs and feet"], "dark eyed junco": ["White outer tail feathers", "Gray head and back", "Brown spotted flanks", "Dark grayish wings with two white bars near shoulder", "Small bill and pink legs", "Gray undertail coverts."], "horned grebe": ["Large pointed black and white striped head", "Black chin patch with a white border", "Dark graybrown back and upper wings with pale gray edges.", "White underparts", "Red eyes, yellow bill, and red legs.", "Long neck and small body size compared to other grebes"], "mallard": ["Green head with a white neck ring and black collar", "Brownish body with lighter belly and breast feathers", "White tail stripes on the upper wings", "Yellow bill with dark brown tip", "Blue speculum (iridescent patch of feathers) on its wings", "Gray legs and feet"], "vermilion flycatcher": ["Bright reddishorange upperparts", "Black head, wings and tail with white wing patches", "Small, thin bill with pale base to lower mandible", "White or buffy throat and underparts", "Dark eye line contrasting against lighter face"], "blue grosbeak": ["Large size with a wingspan of 8.310 inches", "Long, broad tail and short rounded wings", "Blue head, neck, back and upper parts with rusty brown edges", "Grayish white underparts", "Black patch on the throat and breast area", "White wing bars with faint yellow edging at the tips of its flight feathers"], "bobolink": ["Brown head with black crown and white eyebrow", "White back and wings with black edging on the outer feathers", "Black tail with white corners", "Whitish underparts streaked in brown", "Yellow patches near bend of wing"], "yellow bellied flycatcher": ["Large head with yellow color around the eyes and throat", "Greyisholive upperparts and whitish underparts, with a faint yellow wash on the breast and sides of belly", "Long wings that appear slightly rounded at rest", "Pale eye ring", "White tail edges with dark barring in between them", "Dark bill"], "brown creeper": ["Small, slender body with long tail", "Pale brown upperparts and white underparts", "Long, decurved bill", "Whitebarred wings and a white eyebrow stripe", "Dark brown or blackish legs and feet", "Alternates short flights between trees with creeping up tree trunks."], "western meadowlark": ["Yellow breast with black Vshaped marking", "White throat and belly", "Dark brown or black upperparts", "Barred tail feathers", "Long, pointed bill with a yellow base", "White stripe extends from the bill to the eyes", "Oval white patch on the wings"], "acadian flycatcher": ["Small, compact body", "White eye ring around dark eyes", "Grayisholive upperparts with two white wingbars and rusty tail feathers", "Pale yellow underside with faint olive wash on the sides of its breast", "Long, thin bill curved downward at the tip", "Dark legs and feet"], "green violetear": ["Bright green upperbody and wings", "Violet lower body, especially on the throat", "White tufts of feathers along sides of head", "Black tail tip", "Red eyes with white outer ring around them", "Small pointed beak"], "hooded oriole": ["Orangeyellow body plumage", "Dark hood, bib and wings with white wing bars", "Long tail with yellow tips on the outer feathers", "White eyes and bill", "Pale yellow legs and feet"], "yellow breasted chat": ["Bright yellow chest, throat and belly", "Dark brown head with white eyebrow stripes", "Black line extending from the beak to the crown of the head", "White spots on wings, back and tail feathers", "Orangered patch on cheeks below eyes", "Yellow legs"], "bronzed cowbird": ["Glossy, bronzecolored feathers on back, wings and tail", "Darker brown head and neck with faint streaking", "White eyebrow and throat patch", "Yellow eyes", "Short, dark bill", "Long wings that extend beyond the tail when perched"], "black footed albatross": ["Black and white plumage with black wings", "Yellow bill, grayish in juveniles", "Long pointed wings for gliding flight", "White head and neck and dark brown eyes", "Dark feet with pink webbing between toes"], "glaucous winged gull": ["Dusky gray upperparts and pale gray underparts", "Bluegray mantle with white spots", "White head and neck, often streaked with brown or black", "Bright yellow bill with red spot near the tip", "Pink legs and feet", "Large, broad wings with a distinctive glaucous (bluegreen) sheen"], "brandt cormorant": ["Large, slender body with a long neck and pointed bill", "Black feathers with white stripes on the wings", "White patches on sides of head, back of neck and chest", "Smaller than most other cormorants", "Long tail that is usually held horizontally or slightly raised in flight", "Yellowish legs and feet"], "gray kingbird": ["Gray body with darker head and wings", "White stripe on forehead", "Distinctive white patch on its wings", "Pale yellow underparts", "Dark tail feathers with broad, white edges"], "pine grosbeak": ["Large size and long wings", "Dark gray head, neck, and back", "Red or pink plumage on the breast, belly, rump and tail", "White patches under the wings.", "Yellow bill with black tip."], "orchard oriole": ["Orangeyellow underside and black back with a white wing bar", "White eye ring and thin, curved bill", "Long tail that is mostly black with an orange tip", "Rounded wings, rounded head shape", "Breeding male has a solid black hood that extends from the forehead to the nape of its neck"], "western gull": ["Large size and bulging forehead", "White head, neck, and underparts with darker grey upper parts", "Bright yellow bill with red spot near the tip", "Dark eyes with pale eyering", "Pink legs and feet", "Scalloped pattern on wings"], "eared grebe": ["Black cap and head", "White forehead", "Bright yelloworange bill", "Dark red eyes with white surrounding area", "Long neck with a white throat patch", "Greyishbrown upper parts of body, back and wings", "Creamy or whitish underparts", "Short legs for its size (black in color)", "Light grey feet"], "crested auklet": ["White crest of feathers on the head", "Large, dark eyes surrounded by a yellow eyering", "Small black bill with orange markings at the base", "Grayish brown upper body and white lower half", "Orange tinged undertail coverts and flanks", "Darker barring on back and wings with white tips"], "spotted catbird": ["Small, slim body with a long tail.", "Dark grey feathers on the back and head, with palebrown underparts.", "Spotted black markings on wings and tail.", "White ring around eyes, extending to the sides of its face.", "Long beak that curves downwards at the tip."], "mangrove cuckoo": ["Mediumsized bird with a long tail and slender body", "Dark reddish brown head, neck, chest and belly with white throat patch", "Gray back and wings", "White spots on the sides of its body at the base of its wings", "Finely barred tail feathers underneath in shades of gray or brown", "Long yellow bill curved slightly downward towards tip"], "laysan albatross": ["Long, narrow wings with a span of up to 6.5 feet", "Large yellow bill with dark tip and pink base", "White plumage with darker greyish feathers on the back, upper wings and head", "Light grey legs and feet", "Dark eye patch surrounded by a light feathered area"], "eastern towhee": ["Dark gray head and back with reddishbrown rump", "White underparts with black streaks on the breast and sides", "Long rustyred tail with white edges", "Large yellow eyes surrounded by short, thick eyebrows", "Bold white crescent shape behind its eye", "Short, thick brown bill"], "rose breasted grosbeak": ["Colorful plumage with black, white and shades of red", "Large head and short tail", "White patch on cheek and forehead", "Black \"vest\" with a bright rosered band across the breast area", "Dark wings with two bold white wing bars"], "great crested flycatcher": ["Large size (up to 8.5 inches)", "Gray head, back and wings with two white wing bars", "Bright yellow belly and chest", "Black tail with white outer edges", "Long bill, slightly hooked at the end", "White eye ring"], "anna hummingbird": ["Long, pointed bill", "White coloration on the throat and upper breast", "Greenishbrown back and crown", "Dark reddish line extending from the base of its bill to the eyes", "Dark patches of feathers on the sides of its neck", "Brown wings with white markings near tips"], "blue jay": ["Blue feathers, with a white chest and belly", "A black necklacelike marking on their throat", "Black crest on the head", "White bars or stripes along the wings and tail", "Dark blue bill, legs, feet and eyes"], "rhinoceros auklet": ["Bulky, thicknecked body", "Signature orange and black bill with a yellow tip", "Striking white plumes over eyes during breeding season", "Dark brown back, wings, and tail feathers", "White speckles on upper breast and sides of neck", "Pale gray underparts"], "indigo bunting": ["Bright, iridescent blue feathers", "White patch on the underside of its wings", "Orangeyellow beak and legs", "Black eye line with white crescent above it", "Long, pointed tail feathers"], "pacific loon": ["Long, slender body with a pointed bill", "White underparts and neck contrasted by dark gray upperparts", "Yellow eyes", "Black cap on the head that extends to the nape of the neck", "Large white crescentshaped patch near forehead", "Thick black bar across wings when in flight", "Bill is straight, not hooked like other species of loon"], "herring gull": ["Large yellowtipped bill with a red spot near the tip", "Long, pointed wings with black wingtips and white undersides", "White head and neck, gray back and upper wings", "Black tail band at the end of its tail", "Pinkish legs and feet", "Dark smudges on its sides"], "florida jay": ["Brownishgray head, neck and back.", "White throat with a black line running through it.", "Pale yellow chest and belly.", "Black wings with white spots on the outer edges of the feathers.", "Long tail that is mostly gray but with a black tip at the end.", "Yellow legs and feet."], "scissor tailed flycatcher": ["Long, forked tail that is twice the length of its body", "White belly and gray upperparts", "Black breast band with white edges", "Bright red eyes", "Large head relative to its size", "Prominent crest on top of its head"], "baltimore oriole": ["Bright orange and black plumage", "White wing bars in flight", "Black head with white eye ring", "Male has striking black and orange face pattern", "Long tail feathers that are often held at an angle or droop down when perched", "Long, pointed bill", "Duller coloration than other oriole species"], "clark nutcracker": ["Red head and crest", "Grayishbrown wings and tail feathers", "White eyering with black pupil", "Black bill with a light red tip", "Dark gray legs, feet, and claws", "Bright white wing linings on the inner sides of its wings"], "red legged kittiwake": ["White head and neck, with black cap extending down to the eyes", "Upper parts of body are mostly white with black wings and tail", "Distinctive red bill and legs", "Short forked tail", "Yellowishgreen eye ring"], "ringed kingfisher": ["Brightly colored plumage with shades of blue, white and rusty brown", "Relatively large size (1214 inches)", "Long, daggerlike bill with a black tip", "Blue band around the neck that fades to rust at the back", "Orange or red legs and feet."], "parakeet auklet": ["Shorter, more rounded wings compared to other auklets", "Smaller body size than most other auklet species", "Distinctive yelloworange bill with a broad black band at the base", "Dark grey head and chest with white feathers around their eyes and lower throat", "White forehead patch bordered by dark grey on each side", "Bright yellow feet and legs"], "green kingfisher": ["Vivid, bright green plumage", "Darker green head with a white throat and cheek patch", "Long, pointed bill that is blackishblue in color", "Bright orange legs and feet", "White spots on the wings and tail feathers"], "ring billed gull": ["Long, bright yellow bill with a black ring near the tip", "White head, neck and body", "Gray back and wings with black tips on the outer primaries", "Red spot at the base of its bill", "Dark eyes with red orbital rings"], "groove billed ani": ["Long, thin bill with a sharply curved tip", "Broad forehead and short crest", "Visible black eyering", "Dark grayishbrown body coloration", "Light orange to yellowish beak", "Bluishblack wings and tail feathers", "Long legs with distinctive toes pointed inwards"], "white breasted kingfisher": ["Large size (2025 cm)", "White breast and orange belly", "Blue wings, back, tail and head with a black mask around the eyes", "Red bill with a black tip", "Long white supercilium above the eye that runs to the back of the head", "White throat patch in front of neck", "Orange legs"], "nighthawk": ["Long, pointed wings", "Narrow body shape with a short tail", "Small head and eyes", "Dark feathers on the back that may appear iridescent or glossy in light", "White patches at the base of the wings and tail", "A white throat patch or band across its breast."], "frigatebird": ["Long streamerlike tail feathers", "Long, pointed wings with blunt tips", "Relatively large size compared to other seabirds", "Black or brown plumage with white design markings on the chest and belly", "Long hooked bill which is brightly colored in some species", "Red throat pouch used for display purposes"], "northern flicker": ["White underbelly with black spots", "Brown back and wings, finely barred with black", "Black tail featuring white rump patch", "Red crescent on the nape of the neck", "Black bib below beak and moustache stripe above it", "Male has a red \"mustache\" line on cheeks; female’s is buffy or absent", "Large white wing patches seen in flight"], "western grebe": ["Long, pointed bill", "Dark gray back and wings", "White throat, belly and sides", "Black neck with thin white stripe on the sides of the head", "Bright yellow eyes set off by a red eyering", "Red legs, feet and webbed toes"], "sooty albatross": ["Dark brown to blackish plumage with a paler head and neck", "Heavy bill and long wings that reach beyond the tail when in flight", "White markings on the forehead, around the eyes, at the base of the bill, and underwings", "In some individuals, a pink patch at the base of lower mandible", "Small white patches on back of wings visible in flight"], "pelagic cormorant": ["Long and slender body shape", "Large webbed feet", "Long, pointed wings with a sharp bend near the tip", "Black head and neck feathers that give a shaggy appearance", "White patch on the face between the eye and bill", "White breast plumage that often has grey spots along its lower edge", "Grey back, wings, tail feathers and legs"], "purple finch": ["Smaller size than a house finch", "Brownstreaked upperparts with faint reddish wash on wings and tail", "White underside, sometimes with light pink tinge", "Dark, conical bill with sharply pointed tip", "Pink or rose colored face patch bordered by white eyebrow line and black crown stripe"], "green jay": ["Bright blue head, wings and tail.", "Bold white belly patch with a distinctive black band across the chest.", "Greyishgreen back and crown.", "Black beak with yellow markings near the base.", "White streaks on each side of its neck that connect to its white breast feathers.", "Longer tail than other jays in the same family."], "painted bunting": ["Male painted buntings have a vibrant blue head and upper chest, with a bright green back, wings and tail.", "They also have bright red rump and cheeks.", "Females are mostly dull brownishgreen on the upper body, paler yellowgreen on the underparts.", "Males often show a black mask around their eyes during breeding season.", "The bill of both sexes is dark gray in color with an orange base near"], "evening grosbeak": ["Large, stocky body with a thick neck and short tail.", "Bold yellow forehead and eyestripes that run down its cheek to the base of its bill.", "Bright lemonyellow patch on each side of their neck with black spots in the center.", "Olive green back with white bars running across it.", "White underparts streaked with dark brown or grey, giving them a mottled appearance.", "Short,"], "ovenbird": ["Small size, about 5 inches in length.", "Short, round body with a somewhat long tail.", "Redbrown crown and back of head, white throat and breast with dark streaks.", "Gray wings with two white wingbars on each side.", "White eye ring outlined in black.", "Pale yellowish legs and feet"], "fish crow": ["Longer, more curved bill compared to the American crow.", "White iris in adults and pale dull gray eye color in juveniles.", "Slender body with long legs and wings that give it a graceful silhouette when flying.", "A distinct call consisting of two syllables, “FISHah” or “CAAWah” that is higher pitched than an American crow.", "Dark brownish black feathers with"], "chuck will widow": ["Long and slender bill with a hooked tip", "A pale graybrown crown, nape, and upperparts", "Whitish throat, buff underparts with faint streaks on the sides of breast", "Dark eye with white line extending from near the base of bill to behind the eye", "White rump patch and tail with black edges"], "heermann gull": ["Medium size with a wingspan of about 4550 cm (1820 inches)", "Grey back and wings, white head and underparts, black wing tips.", "Slender body shape with long pointed wings and a moderately forked tail.", "Red bill with black tip.", "Black legs and feet."], "slaty backed gull": ["Large, heavy body", "Dark gray or black back and wings", "White head with a black patch extending from the eye to the base of the bill", "Bright yellow bill with red spot near tip", "Red ring around eye", "White underparts, often streaked gray on sides and breast", "Gray legs and feet"], "pomarine jaeger": ["Long, pointed wings with a pronounced notch in the outermost primaries", "Darker gray upperparts with white underparts", "White throat and cheeks bordered by a black \"moustache\" line", "A forked tail that is tipped white on both sides", "Long bill with yellow at the base of the lower mandible", "Black cap extending from forehead to nape"], "cardinal": ["Red body, gray wings, and a black face with red around the bill", "Long crest of feathers on its head", "Black mask extending from its eyes to the base of its beak", "Large, pointed bill that is bright yellow or orange in color", "Rounded tail that has either a reddishbrown or dark brown hue", "White patches along each side of their chest", "Rufous underparts"], "gray crowned rosy finch": ["Red head with a gray crown", "Graybrown back and wings", "White breast and rump", "Black tail feathers with white bars", "Brownish flanks and sides of breast", "Dark brown barring on the wings and tail"], "pied kingfisher": ["Black and white plumage", "Large red bill with a black tip", "Long, slender body", "Shaggy crest on the head", "Bright orange legs and feet"], "european goldfinch": ["Small and stocky body, typically measuring 4.35.1 inches in length", "Short forked tail with a sharp point at the tip", "White or yellow face surrounding the dark eyes and bill", "Dull olivebrown back, wings and tail feathers with two white wing bars", "Bright red face patch on males (females have an orange/yellow facial patch)", "Black wings with prominent white patches on each side of"], "least auklet": ["Small size, measuring between 4 and 5 inches in length", "Grayishbrown upperparts with fine barring", "Long slender bill that curves downward at the tip", "White underparts lacking any spotting or streaking patterns", "Dark eyes surrounded by white eye rings", "Pale yellow legs and feet"], "brown pelican": ["Large, dark brown body with a white belly", "Long neck and long bill extending from a large head", "Grayishbrown wings that are longer than their bodies", "Yellow patch on the forehead and upper throat area", "White stripe along the top of each wing", "Brown tail feathers that droop down below the length of its body"], "horned lark": ["Small size (4.76.3 inches in length)", "Brown plumage with a white face and throat, black chin and mustache stripe", "Black crown with two yellow feather tufts (\"horns\") at the back of the head", "White eyebrow line between eyes and bill", "Pale yellow underparts streaked with dark brown", "Broad, pale edges to wings and tail feathers"], "gadwall": ["Long, narrow wings.", "Slender body and head.", "White undertail coverts.", "Brownishgrey upperparts with black barring on the back feathers.", "Dark brown breast with light grey to white belly and flanks.", "Black crown bordered by a white stripe above the eye.", "Gray bill with yellow near its base in adult males during breeding season."], "long tailed jaeger": ["Long pointed wings that taper to a point, resembling a triangle or diamond in flight", "Long tail with several white bars on the end", "Dark brown body with lighter brown barring and mottling on the head, chest and back", "White crescentshaped patch at base of primary feathers near wrist area (sometimes absent)", "White rump patch visible in flight", "Pale grayish legs and feet"], "boat tailed grackle": ["Large black body with glossy, iridescent feathers.", "Long tail which is rounded or boatshaped at the end (hence its name).", "Bright yellow eyes.", "Long, pointed beak for feeding on insects and seeds.", "Males have a bright purple head and throat patch.", "Females are duller in coloration than males and lack the purple patches on their heads and throats."], "rufous hummingbird": ["Rufous hummingbirds have a rufouscolored back and sides with a green crown.", "The throat is usually bright orange or rusty red, with some white spots on the side of the neck.", "Their tail feathers are long and pointed, tipped in black and white, with white edges along each feather.", "They have a short but sturdy bill that is slightly decurved at the tip.", "The legs are relatively short compared"], "white necked raven": ["White head and neck plumage", "Black feathers on the rest of the body", "Longer beak than other ravens", "Pale silvery eyes", "Larger wingspan than other raven species"], "black throated sparrow": ["Black throat with white border", "White underparts and gray upperparts", "Brown streaks on wings, back and breast", "White eyebrow line", "Gray crown with black central stripe and yellow lateral stripes"], "prairie warbler": ["Striped yellow breast", "Olivegreen body", "White eye ring", "Grayish cheeks and crown", "Prominent white wing bars on its wings", "Pale gray legs and feet"], "blue winged warbler": ["Bluegrey crown and face", "White eye ring", "Bright yellow throat and breast, streaked with black", "Two white wing bars on wings", "Pinkish legs", "Dark olive back and tail"], "green tailed towhee": ["Brown back and wings with a bright olivegreen tail", "White belly and throat", "Bold white eye ring", "Streaked brown crown, face, and breast", "Thick dark bill with yellow lower mandible", "Long legs"], "brown thrasher": ["Long, curved bill", "Bright yellow eyes with reddishbrown eye rings", "Streaked brown upperparts and heavily streaked underparts", "Rust colored tail with white tips on the outer feathers", "White throat patch and breast spots"], "yellow throated vireo": ["Bright yellow throat, breast and sides", "Darker olivegreen back and wings", "White eye ring with dark line extending from the bill to the eye", "Relatively short, squared off tail", "Pale gray legs"], "orange crowned warbler": ["Orange crown", "White eye ring", "Grey head, back and wings", "Yellow underparts with grey streaking on breast", "Gray tail with white edges at tips of feathers", "Light pinkish legs"], "american redstart": ["Black and gray wings with white spots", "Scarlet red chest, sides, belly and tail feathers", "White wing bars on both sides of the wings", "Thin white eye ring", "Thin bill with a dark tip"], "bay breasted warbler": ["White eye line", "Chestnut colored cheeks", "White throat and breast with black streaks on sides", "Grayish blue upperparts, wings, and tail", "Pale yellow belly", "Two white wing bars"], "summer tanager": ["Bright red head and upper chest, dark wings and tail", "Yellowgreen body with white spots on the back", "White or yellowish patches on the wings", "Black bill with a pointed tip", "Dark legs and feet"], "american pipit": ["Small, slender body", "Long tail that is usually held horizontally when perched", "Brownishgray back with contrasting white underside and throat", "Darker crown", "White eye ring", "Light orange bill and legs", "Broad pale wing bars in flight"], "white pelican": ["Long bill with a downward curve", "Large size (up to 6 ft wingspan)", "Entirely white plumage and black wingtips", "Pouch under the beak for scooping up fish", "Orange legs and feet"], "horned puffin": ["Brightly colored beak with white and yellow stripes", "\"Horns\" on the sides of the head, just above the eyes", "Orange cheeks and chin", "Dark brown body with black wings and tail", "Red feet and legs"], "white throated sparrow": ["White throat and chest with grayishbrown upperparts", "Black and white striped crown", "Yellow patch in center of the head between eyes", "Pink bill with black tip", "White wing bars on both wings", "Brown streaks along back, sides, and flanks"], "cape may warbler": ["White eye ring", "Gray crown and back with yellowish wash on the sides, nape and rump", "Yellow throat and breast with black streaks", "Black wings with two white wing bars", "Orangeyellow legs"], "tennessee warbler": ["Olivegreen upperparts", "White underparts with yellow sides and undertail coverts", "Dark line through eye", "Two white wing bars on each wing", "Yellowish legs and feet", "Whitish eyebrow stripes above the eyes"], "hooded warbler": ["Blackandwhite striped head with a yellow crown patch", "White eyering and white supercilium", "White underparts with black streaks on the sides and flanks", "Gray back, wings, and tail", "Yellow legs and feet"], "clay colored sparrow": ["Pale brown upperparts", "White underparts with heavy streaks on the breast, sides, and flanks", "Dark lores (the area between the eye and bill)", "Two white wing bars", "Short tail with a pale rufous patch at the base of it."], "red eyed vireo": ["Red eyes", "White throat contrasted with olivegreen upperparts and yellowish underparts", "Two white wingbars on its wings", "A stout bill and dark crown stripe with pale sides", "Long tail which often has a faint white tip"], "harris sparrow": ["Dark brown cap and upper back", "Orangebrown face, throat, and chest", "White belly and under tail feathers", "Brown wings with white stripes on the outer edges", "Large yellow bill with black tip"], "rock wren": ["Long, rounded tail", "White eyebrow stripe", "Dark brown back and wings with white barring", "Grayishbrown crown", "Pale buff underparts with dark streaking", "Long, thin bill", "Brown legs and feet"], "cape glossy starling": ["Round head and short tail", "Bluegreen plumage with metallic gloss", "White spots on the wings and back of neck", "Pale yellow bill and legs", "Black patch around eyes extending to nape", "Longer, pointed central tail feathers"], "yellow warbler": ["Bright yellow feathers on the head, body and wings", "White patches on the wings and tail", "Thin black line through each eye", "Orangebrown streaks on the chest", "Small white spots at the tips of some wing feathers", "Light gray legs with pink feet"], "sayornis": ["Long, thin bill", "Pale buffybrown coloration", "Large white wing patches visible in flight", "Greyish head and back with pale yellowishbuff breast", "Dark tail with faint barring on the outer rectrices", "White eye ring"], "henslow sparrow": ["Small, round body", "White eyering and white throat", "Rusty crown and streaks on back", "Dark central tail feathers", "Grayishbrown wings with pale edges", "Buffy underparts with faint streaking", "Short bill"], "cactus wren": ["Brown, white and black mottled feathers", "Spotted tail with a black band at the tip", "White stripe over its eye", "Long legs", "Thick bill with a downward curve", "Long wings that extend past its body when in flight"], "cedar waxwing": ["Pale yellow/orange crown on head", "Black mask around eyes and across forehead", "White stripes on wings", "Brown body with pinkish tinge", "Small crest at the back of the head", "Gray tail with bright red tip"], "geococcyx": ["Long, slender body", "Pale gray to brownish feathers with white spots on the wings", "White patches of feathers on the back and tail", "Black tipped tail, crown and throat patch", "Red eyes with black rims", "Large feet and legs for running in the desert"], "chestnut sided warbler": ["Grayisholive head and back, with yellow underparts", "White wing bars", "Dark line extending from eye to bill", "Rust colored sides and undertail coverts", "Thin white eyebrow stripe", "Black lores (area between eyes and bill)"], "bank swallow": ["Slender, streamlined body", "Pointed wings", "Dark chestnut back and rump", "White underparts with a brownish wash on the sides and belly", "Pale buff forehead above a dark line through the eyes", "Mostly white tail with narrow dark bands at tips of outer feathers"], "canada warbler": ["Olivegreen upperparts with yellowish underparts", "White crescent shape marking on the side of its neck", "Pale grey crown and face, streaked in black", "Two bold white wingbars along its wings", "Bright yellow line running down its back", "Short tail that is usually raised when it's walking or flying"], "common tern": ["Long, deeply forked tail", "Pale grey upperparts with black and white cap", "White underparts with a pale grey wash on the flanks", "Orangered bill and legs", "Black leading edge of wings"], "mourning warbler": ["Large, round head", "Pale yellow underparts", "White eyering", "Grayish olive upper parts", "Streaked sides and back", "Darker wings with two pale wing bars", "Long tail with white outer feathers and dark central feathers"], "american three toed woodpecker": ["Red crest on the head", "Bright red cap", "White stripes and black bars on back of neck", "Black and white barred wings", "Male has a bright yellow patch at the back of its head", "Three toes, two in the front and one in the rear"], "red headed woodpecker": ["Red head and neck", "White cheek patches", "Black crest on top of head", "Dark wings with white barring on the back and sides", "Large black spot at base of tail feathers", "Yellowishwhite breast", "Black bill that is slightly curved downward"], "western wood pewee": ["Pale graybrown overall with a light brown head and neck", "White wing bars", "Darker tail with faint white edging on the outer feathers", "Long, narrow dark bill", "Yellowish lower mandible (bottom of the bill)", "Whitish belly and undertail coverts"], "golden winged warbler": ["Small body with a long tail and a rounded head", "Greyishbrown above, yellow below", "Brightly colored yellow face patch bordered by black stripe", "White eye ring and white wing bars", "Distinctive golden shoulder patches on wings (only visible in flight)"], "magnolia warbler": ["Bright yellow underparts with a white breast and belly", "White eyering and wing bars", "Gray back, wings, cap, and tail", "Black face patch framed by the white eyering", "Thin bill that curves slightly downward", "Longer tail than other warblers"], "black throated blue warbler": ["Bluegray head and upperparts", "White belly and undertail coverts", "Black throat bordered by white patch on side of neck", "Two white wing bars", "White line over eyes, cheeks, and down to sides of neck", "Thin bill with yellow lower mandible"], "whip poor will": ["Grayishbrown coloration with a lighter underbelly.", "Large eyes and relatively short tail.", "Black bill and long, pointed wings.", "White wing patches that are most visible when in flight.", "Two white barring lines across the back of the neck and behind the head."], "lincoln sparrow": ["Long, slender body", "Dark brown upperparts and pale gray underparts.", "Obvious white eye ring with a dark center.", "Small orangebrown breast spot.", "Notched tail with short, pointed feathers.", "White outer tail feathers visible in flight."], "downy woodpecker": ["Small, stocky body", "White belly with black spots", "Black and white striped back", "Red spot on the back of its head (males) or at the nape (females)", "White wing bars on outermost primary feathers", "Short but strong bill for hammering into wood."], "artic tern": ["Black cap and white forehead", "Light grey back with black wings and tail feathers", "White underparts, including a wedgeshaped tail", "Orange legs and bill", "Long pointed wings with distinctive black markings on the upper surfaces"], "loggerhead shrike": ["Black mask that wraps around the eyes and across the top of the head", "White throat patch with a black border", "Large bill and hooked tip", "Graybrown upperparts and white underparts", "Long, tail with a rounded tip", "Black wings with white patches near the tips"], "blue headed vireo": ["Bluishgrey upperparts", "White under parts with faint yellow wash on breast and flanks", "Blue crown, face and neck", "White line over the eye and white eyebrow.", "Darker blue band across back of neck", "Yellow iris", "Dark bill, legs and feet"], "field sparrow": ["Greyishbrown above, with white streaks on back.", "Pink bill and legs.", "White eye ring and dark line through the eyes.", "Rusty crown patch in male birds.", "White undertail coverts with buffy edges.", "Dark streaked breast with pale grey belly."], "white eyed vireo": ["Bright white eyering", "Olive green upperparts with yellowish highlights on the wings and tail", "White or yellowish underparts with thin, dark streaks on the breast and sides", "Darker olive face mask that extends above the eye", "Broad, pointed bill", "Gray legs and feet"], "seaside sparrow": ["Long, straight bill", "Dark gray back with white spots", "Grayishbrown head and neck", "White throat and breast with black streaks", "White belly and undertail coverts", "Brown wings with white patches on the sides", "Wide white eyebrow stripe", "Short tail that is forked at the end"], "fox sparrow": ["Reddishbrown upperparts, streaked with black and white", "Thick dark eyeline with pale eyebrow above it", "White belly and throat with a gray chest band", "Dark tail with whitish outer feathers", "Rusty patches on the wings"], "red bellied woodpecker": ["Red head and nape feathers", "White forehead and a black crown, bordered by white stripes on the sides of the head.", "Black back, wings, and tail with white barring.", "Grayishwhite throat and breast with red belly patch.", "Pale yellow bill with a dark tip.", "Dark legs and feet."], "tree sparrow": ["Smaller than a house sparrow with a round head and short tail", "Reddish brown cap and cheeks, black chin, throat and bib", "White stripes at the sides of its face near its eyes", "Palegrey underparts", "Black spots on white wings", "Dark legs"], "carolina wren": ["Brownishgray upperparts", "Bold white eyebrow stripe", "Rusty barring on wings and tail", "White throat, belly, and undertail coverts", "Orange or reddish patch on chest", "Bright rusty crown with black crown stripes", "Long, thin bill", "Dark legs"], "common raven": ["Large, allblack plumage", "Thick bill and shaggy throat feathers", "Long wings with a slight Vshape when gliding or soaring", "Fluffy tail feathers that spread out fanlike in flight", "White patches on the base of the neck and shoulders", "Loud “caw” call"], "barn swallow": ["Deeply forked tail", "Rounded head and short, squaredoff tail", "Long wings that extend beyond the tip of its tail when at rest", "Pale brownish upperparts with slightly darker wings and a pale rufous belly", "White forehead, chin, throat and cheeks outlined in black", "Dark blue to blackish coloration on the crown, nape and back of neck"], "common yellowthroat": ["Grayish olivegreen back and wings", "Yellow throat and breast with a black mask on the face", "White belly and undertail coverts", "A streaky brown pattern on its sides", "Long, pointed bill with a yellow lower mandible"], "bohemian waxwing": ["White and brown mottled body plumage", "Black face mask with white eyebrow line above it", "Red or orange waxy tips on secondary flight feathers", "Grayish undertail coverts", "Pale yellowtipped tail feathers", "Short black bill with pink base"], "least tern": ["Small size (only 810 inches long)", "Short, forked tail with distinctive white outer feathers", "Pale gray upperparts and wings, with a black cap on head", "White underparts and forehead patch", "Black legs and bill with yellow tip", "Yellow feet"], "house sparrow": ["Streaked brown back and crown", "Pale gray underparts", "White cheeks, throat, and belly", "Black bib on the chest", "Brownblack tail with white outer feathers", "Grayish bill and feet"], "northern waterthrush": ["Large, round head", "Olivebrown upperparts with dark streaks", "White eyestripe and supercilium (eyebrow)", "Pale grayish white underparts with dark streaking on the sides of the breast and belly area", "Long, slightly curved bill", "Short tail with pale outer feathers", "Yellow legs"], "philadelphia vireo": ["Large, round head with a short bill.", "Grayisholive upperparts and white underparts.", "Two white wingbars on the wings.", "Yellowish wash on the face and throat.", "White eyebrow extending from the eyes to above the nape of neck.", "Darker olive green crown with pale yellow central stripe in some individuals."], "tree swallow": ["Mediumsized, slim body with a slender bill", "Metallic bluegreen upperparts and white underparts", "White forehead and chin, with a dark line extending from the bill to eye", "Blackish tail with white edges on the outer feathers", "Dark wings with white patches near tips"], "myrtle warbler": ["Olivegreen upperparts with yellowish underparts", "White wing bars and tail spots", "Thin, black bill with white eye ring", "Gray legs and feet", "Yellow patch on throat", "Light brown streaks on back"], "chipping sparrow": ["Striped black and white crown", "White eye ring", "Brown back and wings with dark streaks", "White underside with darker streaking on sides of breast", "Pink bill with a black tip", "Rusty, orangebrown cap above grayish nape", "Grayish face and throat"], "prothonotary warbler": ["A bright yellow head and underparts", "Bluegray upperparts with two white wingbars", "White throat and undertail coverts.", "Dark line extending from the eye to the bill.", "Long, slim tail with white spots near the tip.", "Orange legs and feet"], "swainson warbler": ["Small and round body", "Grayishbrown upperparts and pale yellow underparts", "White supercilium (eyebrow)", "Black lores (space between the eyes)", "White crescent on the sides of the throat", "Thin, pointed bill with a slightly curved lower mandible", "Streaked breast"], "grasshopper sparrow": ["Brown and buff upperparts with white wing bars.", "White underparts, with fine dark streaks.", "Dark line through eye and short bill.", "White central tail feathers with narrow brown edges.", "Pale supercilium (eyebrow stripe).", "Pale yellowish legs and feet."], "song sparrow": ["Brownishstreaked back and crown", "White eyebrow stripe", "Gray cheeks and breast with brown streaks", "Rusty colored patch on the chest", "Dark streaking on the sides of its white belly", "Orange beak, legs, and feet"], "white crowned sparrow": ["White crown with black markings", "Grey face and nape", "Brown back, wings and tail", "Yellow lores (eyeareas)", "Bold white eyebrow stripe", "Pink bill with dark tip", "Dark streaks on the chest"], "great grey shrike": ["Large, stocky body with a long tail.", "White eyebrow stripe and black mask over the eyes.", "Greybrown plumage on the upperparts and white underparts.", "Black wings with white patches at the base of each feather.", "Long, hooked bill for eating prey like small rodents, lizards, insects and birds.", "Bold black ‘V’ shape across its back when perched in an upright position."], "house wren": ["Brownishgray upperparts with white spotting on wings, back, and tail.", "White throat, belly, and undertail coverts.", "Narrow black eye line with white eyebrow above it.", "Black bill and legs.", "Short rounded tail that is often cocked upward or slightly to one side when perched."], "cerulean warbler": ["Small, slim body with a short tail and pointed wings", "Short, thin bill", "Bluishgray head and neck", "White eye ring and white throat patches", "Blue upperparts and yellow underside with two thin black stripes on the sides of its chest", "Dark blue tail feathers that are slightly darker than the back"], "wilson warbler": ["Gray head with a yellow patch on the crown", "White line above eyes and below bill", "Olivegreen back and wings", "Whitish underparts with faint streaking on chest, sides, and flanks", "Two white wing bars visible in flight", "Long tail often held upright when perched"], "nelson sharp tailed sparrow": ["Gray head with a pinkishbuff crown stripe and black eyeline", "White throat, brightly colored breast and sides", "Distinctive white eyebrow line", "Dark central tail feathers with white outer edges", "Pink bill with a dark tip"], "vesper sparrow": ["Brownish gray upperparts with a white eye ring", "White underparts with dark streaks on the breast and sides", "Reddishbrown crown and nape, often appearing darker than the back.", "Thin buff supercilium (eyebrow)", "Gray wings with two pale wing bars", "Longer tail than other sparrows of its size"], "kentucky warbler": ["Mediumsized warbler with a short, stout bill", "Brownish upperparts, white underparts and yellow throat bordered by black stripes on the sides of its neck", "Long, white eyebrow stripe extending from eye to rear of head", "White crescent above each eye", "Dark gray wings and tail with two narrow white wing bars", "Yellow legs"], "scarlet tanager": ["Scarletred feathers on upperparts, wings and tail", "Black wings with white wing bars and edges", "White underside or belly", "Yellowishgreen back, rump and shoulders", "Dark bill with yellow lower beak", "Distinctive white crescent patch above the eye"], "worm eating warbler": ["A relatively large bill with a slightly upturned tip", "A greyishbrown head and neck, with a paler yellowish wash on the face", "White throat and breast, lightly streaked in darker brown", "Pale buffy flanks, heavily streaked in dark brown", "Brown back feathers that are finely barred in white or pale grey", "Two white wing bars and two faint whitish supercilia lines above the eye"], "elegant tern": ["Long, pointed wings with a slight upward curve", "Slender black bill and legs", "White forehead and crown; grayishbrown cap on nape of neck", "Gray back and wings, white lower belly and rump", "Black outer primary feathers visible in flight", "Dark crescent below the eye to the base of the bill"], "pine warbler": ["Small, compact body shape", "Grayishgreen upperparts and yellowish underparts", "Dark eyeline and two white wingbars on each side", "White throat with light gray streaks above and below it", "Yellowish supercilium (eyebrow line) over the eyes extending to the back of head", "Thin, pointed bill"], "forsters tern": ["Deep black cap", "White forehead and cheeks", "Long pointed bill, black at the tip and yellowishorange towards the base", "Dark grey back with white rump and tail feathers", "Pale grey wings with darker outer primaries", "Black legs and feet"], "red cockaded woodpecker": ["Black and white striped back", "White cheek patch with a black outline", "Red cap (males only)", "White belly and underparts", "Long barred tail with white spots at the base of each feather", "Black wings with large white patches on the outer edges", "Dark gray legs and feet", "Broad, short bill"], "brewer sparrow": ["Smaller size compared to other sparrows (4.55.25 inches long)", "Dark gray, brown, and black streaked upperparts", "Pale gray underparts with faint brown streaks", "White throat patch and eyebrow line", "Black bib on chest with pinkish wash", "White outer tail feathers that are visible in flight", "Long bill with a slight curve at the end"], "warbling vireo": ["Streaked olivegreen back and wings", "White throat and breast with yellow patches on sides of chest", "White eyebrow line above the eye", "Dark spot in the middle of its upper breast", "Yellow to greenish base color on underside of tail feathers", "Two white wing bars along the length of its wings"], "le conte sparrow": ["Small, compact body shape", "Long tail feathers with white tips", "Thin, pointed bill", "Dark grey crown and nape", "Pale brown back and wings with darker streaks", "White throat and underparts with dark streaking on sides of breast.", "White eye stripes extending from the bill to the back of the head", "Bold black line running through its eyes"], "savannah sparrow": ["Brownish plumage on the upperparts", "Whitish underparts with dark streaking", "White eye ring and malar stripe", "Yellow lores, throat and breast spot", "Striped crown extending to nape of neck", "Dark auriculars with pale edges", "Long tail that is usually held upright when perched"], "pileated woodpecker": ["Large size (up to 19 inches long)", "Black body with white stripes on the wings and sides of neck", "Red crest on head", "White line from forehead extending down to its bill", "Long, thick bill for extracting woodboring insects from trees", "Strong, loud call consisting of two or three “kuk” sounds"], "black tern": ["Dark grey or blackishbrown back, wings and tail.", "White head with a thin black cap extending to the nape of neck.", "Black bill with white tip.", "Light grey upperbreast and underparts.", "Short legs and feet that are dark in colour.", "Long, pointed wings with white undersides when seen from below.", "Elegant flight pattern consisting of quick fluttering beats followed"], "black capped vireo": ["Grayish upperparts", "White underparts with light yellow wash on breast", "Black crown, nape and eye line", "Thin white eyebrow stripe above the eyes", "White wing bars and outer tail feathers", "Dark bill and legs"], "bewick wren": ["Small size and rounded body shape", "Short tail, often held upright", "Pale greybrown upperparts, pale buff underparts with dark streaks on breast", "White eyebrow stripe and white chin patch", "Long wings that reach beyond the tip of the tail when perched or flying", "Blackish bill with a yellow base"], "baird sparrow": ["Smaller sized bird with a short tail and rounded wings", "White throat, grey cap and face, streaked brown back", "Brownstreaked white underparts", "Dark eye stripe", "White line above the eye", "Long bill that is slightly curved downwards", "Short legs and pinkish feet"], "sage thrasher": ["Small size: Length of 5.57 inches (14–18 cm) and a wingspan of 10–12 inches (25–30 cm).", "Brownish gray upper parts with lighter underparts.", "White supercilium, or eyebrow stripe.", "Dark markings on the sides which form an \"X\" shape on the back.", "Longer tail than other thrashers; often held in a downward position when perched."], "nashville warbler": ["Gray head, white eyering and yellow throat.", "Whitish underparts with brown streaks on sides.", "Yellow rump patch.", "Dark upperparts streaked with black and white stripes.", "White wing bars, two whitish outer tail feathers and a yellow tip to the central tail feather."], "black and white warbler": ["Black Warblers have a black head, back, and wings with white underparts.", "White Warblers have a white head, back, and wings with black underparts.", "Black Warblers have an orangeyellow patch on the throat while White Warblers do not.", "Black Warbler males also typically have two bold white wing bars that are absent in the female species of this bird.", "The tail feathers of the Black Warbler are"], "cliff swallow": ["Small, stocky bodies with a short tail.", "Rounded heads with large flat foreheads.", "Orange breasts that become darker during breeding season.", "White throats and cheeks, black chin and forehead, chestnut brown backs and wings, rusty colored rump feathers.", "Long outer tail feathers with white spots at the base of each feather.", "Dark blueblack legs and feet."], "marsh wren": ["Brownishgray upperparts with darker streaks and white belly", "White eyebrows, throat, and underparts", "Long, thin bill curved downward at the tip", "Short tail that is squared off at the end", "Head pattern of blackandwhite stripes on either side of its head", "Black patch around its eyes", "Broad wings with a distinctive white stripe across them"], "winter wren": ["Small size and plump shape", "Short tail, often cocked up at an angle", "Brown upperparts with dark barring on back and wings", "Darkstreaked white underparts", "White throat patch bordered by black stripe running down the sides of its breast", "Black line extending from bill to eyes", "White eyebrow and short thin bill"], "palm warbler": ["Brownishgray streaked back and wings", "White undersides with yellow patches on the sides of its belly", "Long, thin bill with a slight droop at the end", "Light brown head with a pale yellow patch across the cheek and forehead area", "Streaks around its eyes, as well as a white line running along each side of its neck", "Darker tail feathers that are slightly forked in shape"], "louisiana waterthrush": ["Long, buffystreaked undertail coverts", "Orange wash on the breast", "Broad white eye ring with thin black border", "Bold white supercilium extending to hind neck", "Dark back and wings heavily streaked with creamy buff or yellowish streaks", "Gray crown and nape bordered by dark line above eye, pale gray ear coverts", "Pale gray cheeks, throat is pale gray fading into whitish underparts"], "caspian tern": ["Large bill with a black tip", "Gray back and white underparts", "Black legs and feet", "Allwhite head, neck, and breast in the breeding season", "Short tail that is mostly white with a black band near the end of it", "Dark red eye patch on either side of its head during breeding season", "Wings are long and pointed"]}